[
    {
        "_id": "67e9aaba8682db629dacf32d",
        "key_id": "youtube_oaOlDw-wlhw",
        "isVideo": true,
        "platform": "youtube",
        "d_source": "y_api",
        "createdAt": "2025-03-31 02:00:47.570000",
        "updatedAt": "2025-03-31 02:00:47.570000",
        "postDate": "2025-03-30 18:29:58",
        "poster_link": "https://i.ytimg.com/vi/oaOlDw-wlhw/hqdefault.jpg",
        "post_content": {
            "postUri": "oaOlDw-wlhw",
            "shortcode": "oaOlDw-wlhw",
            "platform_videoLink": "https://www.youtube.com/watch?v=oaOlDw-wlhw",
            "platform_viewsCount": 333,
            "platform_dislikesCount": 0,
            "platform_likesCount": 6,
            "caption": "Mallika Sukumaran | Row Over Empuraan: Political Pressure Or Proxy Censorship?",
            "description": "A cinematic storm is brewing as the makers of \"Empuraan\" cave to pressure, announcing voluntary cuts to the film amidst a maelstrom of criticism. The movie's depiction of sensitive historical events has ignited a fierce debate, with the BJP and RSS launching a scathing attack on the film's alleged anti-Hindu narrative. Meanwhile, the Kerala CM and Congress have rallied to its defense. Actor Mohanlal has attempted to douse the flames with a public apology, acknowledging the responsibility of artists to avoid inciting hatred. But the criticism continues to pour in, with former Infosys CFO Mohandas Pai branding the film 'propaganda'. At the eye of the storm is a contentious reference to the Godhra riots, sparking a national conversation on creative freedom, historical accuracy, and the boundaries of artistic expression. But the big question is, is it political pressure or proxy censorship?\n\n#Empuraan #EmpuraanMovie #BJP #Congress #Kerala \n\nAbout NDTV (English news channel): \n \nNDTV is India's Most-Trusted News Broadcaster with the latest updates in news, sports, entertainment and much more from within India and around the world. Watch big political debates, exclusive entertainment interviews, news bulletins, current affairs, talk shows and tech reviews with our 24x7 news live streams, packed with credible information across all platforms: TV, Internet and Mobile.\n\nFor Latest Videos, click here: https://www.youtube.com/playlist?list=PLYSfYVdrOZvh5iPadUPTAg3sxFD_DZpT_\n\nTo watch NDTV 24x7's premium shows listed together for your easy access, click here: https://www.youtube.com/@NDTV/playlists?view=50&sort=dd&shelf_id=5\n\nFor Ground Reports and Analysis from NDTV's reporters and anchors of day's top news stories, click here: https://www.youtube.com/playlist?list=PLYSfYVdrOZvgHr6OHiZYKbr_21MOmvk04\n\nFor News in Shorts, click here: https://www.youtube.com/playlist?list=PLYSfYVdrOZvjJ8fhLPk_Fz4tFARkpG-Y-\n\nSubscribe to our channel to get latest news updates.\n \nFollow us on Social Media: \nWhatsApp: https://whatsapp.com/channel/0029Va4lixw7z4kcvZI9JM12 \nFacebook: https://www.facebook.com/ndtv/\nTwitter: https://twitter.com/ndtv/   \nInstagram: https://www.instagram.com/ndtv/ \nTelegram Messenger: https://t.me/NDTVbot/?start=hi \n \nFollow us on Google News for Breaking and Latest News Updates:\nNDTV: https://bit.ly/3e5ngbP\nNDTV India (Hindi News): https://bit.ly/3mNVwMY \n \nDownload NDTV Mobile Apps: http://www.ndtv.com/page/apps \n \n#BreakingNews #LatestNews #TodayNews #News #IndiaNews #CurrentAffairs #NDTV",
            "imageList": [
                "https://i.ytimg.com/vi/oaOlDw-wlhw/default_live.jpg",
                "https://i.ytimg.com/vi/oaOlDw-wlhw/mqdefault_live.jpg",
                "https://i.ytimg.com/vi/oaOlDw-wlhw/hqdefault_live.jpg",
                "https://i.ytimg.com/vi/oaOlDw-wlhw/sddefault_live.jpg",
                "https://i.ytimg.com/vi/oaOlDw-wlhw/maxresdefault_live.jpg"
            ]
        },
        "privacyStatus": "public",
        "embeddable": true,
        "upvoted_by": [],
        "upvotes_count": 0,
        "downvoted_by": [],
        "downvotes_count": 0,
        "country": [
            "IN"
        ],
        "publisher_id": "ndtv",
        "publisher_name": "NDTV",
        "publisher_profile_pic": "https://yt3.ggpht.com/a/AATXAJxJ_sIpYkNa9wLEDlBNmJQ33onVW53NOgO8Z22a_Fs=s900-c-k-c0x00ffffff-no-rj",
        "publisher_desc": "NDTV is one of the leaders in the production and broadcasting of un-biased and comprehensive news and entertainment programs in India and abroad. \n\nIt offers round-the-clock coverage of latest news and has a unique mix of news bulletins, current affairs, talk shows, and general interest and entertainment programs. \n\nThe company operates NDTV 24X7, an English news channel; NDTV India, a Hindi news channel; and NDTV Profit. NDTV's verticals cover an entire gamut of news and beyond news encompassing recipes, travel, entertainment, shopping, books, health, gadgets and special features. \n\nNDTV delivers reliable information across all platforms: TV, Internet and Mobile. \n\nNDTV broadcasts its programmes in Sri Lanka,  Bangladesh, Maldives, Nepal, Middle East, Mauritius, South Africa, Europe, US, Canada & ANZ.",
        "publisher_country": [
            "IN"
        ]
    }
]